ГТС/УТГТС/ExchangePlans/МобильноеПриложениеТорговыйПредставитель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>МобильноеПриложениеТорговыйПредставитель</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйКомпьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МобильныеКомпьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияМобильногоПриложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииМобильныхПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбораСхемыОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьЗаказыПоЗаданию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИспользованиеКонтактнойИнформацииМобильнымПриложением</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ГТС/УТГТС/ExchangePlans/МобильноеПриложениеТорговыйПредставитель/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УзелУжеСуществует = МобильныеПриложения.УзелДляПодключенияСуществует(Пользователь, МобильныйКомпьютер, Ссылка);	
	
	Если УзелУжеСуществует Тогда
		ТекстСообщения = НСтр("ru='Настройка для торгового представителя %Пользователь% и мобильного компьютера %МобильныйКомпьютер% уже существует'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Пользователь%", Пользователь);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%МобильныйКомпьютер%", МобильныйКомпьютер);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	Пользователь = Неопределено;
	МобильныйКомпьютер = Неопределено;
	ИмяПользователя = "";
	Пароль = "";
	ХранилищеОтбораСхемыОбмена = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	// Для этого узла не требуется проверка заполнения ряда реквизитов
	Если Ссылка = ПланыОбмена.МобильноеПриложениеТорговыйПредставитель.ЭтотУзел() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Пользователь");
		МассивНепроверяемыхРеквизитов.Добавить("МобильныйКомпьютер");
		МассивНепроверяемыхРеквизитов.Добавить("ВерсияМобильногоПриложения");
		МассивНепроверяемыхРеквизитов.Добавить("ИспользованиеКонтактнойИнформации");
		МассивНепроверяемыхРеквизитов.Добавить("ИмяПользователя");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
